let group = {
    "第一组": ["陈浩轩", "罗书瀚", "李佳燃", "鲍彦宏", "张益豪", "卢浩", "徐竞楠"],
    "第二组": ["孟雨", "田子烨", "刘雨辰", "郑雅涵", "谭科旭", "阮漫妮", "郭霖君"],
    "第三组": ["赵可乐", "焦翎禹", "邹锦弘", "关宇涵", "伍峻禾", "杜振缘"],
    "第四组": ["朱济增", "梁晋博", "石义生", "孟贺依", "何悦鸣", "陈振宇"],
    "第五组": ["朱家葆", "王思翰", "刘正熙", "罗贝尔", "代文杰", "吴予泽"],
    "第六组": ["邓瑞林", "韩秉成", "朱嘉鑫", "徐铂雯", "黄新月", "尚弘羽霖"],
    "第七组": ["王俊霖", "李浩", "周子涵", "朱蕙清", "张梦洁", "刘时来"],
    "第八组": ["杨开燃", "田博飞", "程靖淞", "赵梓懿", "赵芳梅", "叶慧妍"]
};

let students = [];
let teachers = [];
let intro = [];
let gen_guide = [];
let score = [];


function getGroupByName(name) {
    for (let key in group) {
        if (group[key].includes(name)) {
            return key;
        }
    }
    return '';
}